Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetBase.DimensionPoints Property
 Gets a list of the dimension points.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PointList DimensionPoints { get; }
Public ReadOnly Property DimensionPoints As PointList
	Get
Property Value
Type: PointList
See Also
Reference
CurvedDimensionSetBase Class
Tekla.Structures.Drawing Namespace